{
  "paths": [
    {
      "type": "file",
      "value": "00-A Glossario.md"
    },
    {
      "type": "file",
      "value": "00-Intro.md"
    },
    {
      "type": "file",
      "value": "01-Cloud e AWS.md"
    },
    {
      "type": "file",
      "value": "workingOn.md"
    }
  ],
  "contents": [
    {
      "path": "00-A Glossario.md",
      "url": "00-A Glossario.html",
      "content": "# Glossario\r\n\r\n### Tenant \r\n\r\nUn \"tenant\" è un gruppo di utenti che condividono un accesso comune con privilegi specifici per un'istanza di software. L'architettura multi-tenancy è un modello in cui una singola istanza di un'applicazione software serve a diversi clienti. Ciascun cliente è chiamato \"tenant\".\r\n\r\n\r\n### Workload\r\n\r\nUna \"cloud workload\" è una specifica applicazione, servizio, capacità o quantità di lavoro che può essere eseguita su una risorsa cloud. Tra le \"cloud workloads\" rientrano le macchine virtuali, i database, i container, i nodi Hadoop e le applicazioni.\r\n\r\n\r\n",
      "html": "<h1 id=\"glossario\">Glossario <a class=\"heading-anchor-permalink\" href=\"#glossario\">#</a></h1>\n<h3 id=\"tenant\">Tenant <a class=\"heading-anchor-permalink\" href=\"#tenant\">#</a></h3>\n<p>Un “tenant” è un gruppo di utenti che condividono un accesso comune con privilegi specifici per un’istanza di software. L’architettura multi-tenancy è un modello in cui una singola istanza di un’applicazione software serve a diversi clienti. Ciascun cliente è chiamato “tenant”.</p>\n<h3 id=\"workload\">Workload <a class=\"heading-anchor-permalink\" href=\"#workload\">#</a></h3>\n<p>Una “cloud workload” è una specifica applicazione, servizio, capacità o quantità di lavoro che può essere eseguita su una risorsa cloud. Tra le “cloud workloads” rientrano le macchine virtuali, i database, i container, i nodi Hadoop e le applicazioni.</p>\n",
      "id": 0
    },
    {
      "path": "00-Intro.md",
      "url": "00-Intro.html",
      "content": "# Introduzione\r\n\r\n**AWS Cloud Practitioner** è una certificazione di livello base (entry-level) offerta da AWS che copre una serie di concetti fondamentali legati al cloud computing. In questo corso vengono trattati vari argomenti, tra cui:\r\n\r\n- Fondamenti del cloud\r\n- Concetti del cloud\r\n- Architettura del cloud\r\n- Modelli di distribuzione del cloud\r\n- Panoramica dei servizi core di AWS\r\n- Panoramica dei servizi AWS\r\n- Fatturazione, prezzi e supporto dei servizi AWS\r\n\r\nQuesta certificazione è spesso abbreviata in CCP, ed è particolarmente utile per coloro che vogliono iniziare a comprendere il mondo del cloud computing e acquisire una conoscenza base di AWS (o nella cloud industry).\r\n\r\n\r\n## Chi dovrebbe prendere questa certificazione?\r\n\r\nLa certificazione AWS Cloud Practitioner è pensata per diverse categorie di persone:\r\n\r\n- Chi è nuovo al mondo del cloud computing e ha bisogno di imparare le basi.\r\n- Esecutivi, responsabili o venditori che necessitano di una comprensione strategica del cloud per supportare l'adozione o la migrazione.\r\n- Ingegneri senior specializzati nel cloud o architetti delle soluzioni che vogliono rinfrescare le loro conoscenze dopo anni di esperienza.\r\n\r\n\r\n## Valore della certificazione\r\n\r\nLa certificazione AWS Cloud Practitioner offre una panoramica approfondita dell'architettura del cloud e dei servizi offerti da AWS. Questa certificazione può essere un punto di partenza ideale per chiunque voglia entrare nel mondo della tecnologia cloud.\r\n\r\nEcco una roadmap delle certificazioni AWS:\r\n\r\n![Roadmap](https://github.com/Elpiu/MindMemoir/blob/main/docs/AWS%20CLF-C01%20(AWS%20Cloud%20Practitioner)/imgs/image-roadmap-aws.png?raw=true)\r\n\r\n\r\n## Tempo di studio consigliato\r\n\r\nPer prepararsi all'esame AWS Cloud Practitioner, è raccomandato dedicare in media 24 ore di studio, distribuite idealmente nell'arco di 1-2 ore al giorno per 14 giorni.\r\n\r\n\r\n## Guida all'esame\r\n\r\nL'esame è suddiviso in 4 domini, ognuno con un peso diverso nella valutazione finale:\r\n\r\n**26%**: Dominio 1 - Concetti del Cloud\r\n\r\n**25%**: Dominio 2 - Sicurezza e Conformità\r\n\r\n**33%**: Dominio 3 - Tecnologia\r\n\r\n**16%**: Dominio 4 - Fatturazione e Prezzi\r\n\r\nAlcuni dettagli sull'esame:\r\n\r\n- Per superare l'esame è necessario totalizzare almeno 700 punti su 1000.\r\n- L'esame consiste in 65 domande, di cui 50 con valore e 15 senza valore (utilizzate per misurare la difficoltà).\r\n- Non ci sono penalità per risposte errate.\r\n- Le domande possono avere una o più risposte corrette.\r\n- Il tempo totale a disposizione per l'esame è 90 minuti.\r\n- La certificazione ha una validità di 36 mesi.\r\n\r\nNota: Tieni presente che alcune di queste informazioni potrebbero subire variazioni nel corso del tempo. Pertanto, è consigliabile fare riferimento alle fonti aggiornate, poiché le informazioni datate qui si riferiscono al periodo intorno al 2022.\r\n\r\n\r\n### [Videocorso Youtube by Andrew Brown](https\\://www\\.youtube.com/watch?v=SOTamWNgDKc)\r\n",
      "html": "<h1 id=\"introduzione\">Introduzione <a class=\"heading-anchor-permalink\" href=\"#introduzione\">#</a></h1>\n<p><strong>AWS Cloud Practitioner</strong> è una certificazione di livello base (entry-level) offerta da AWS che copre una serie di concetti fondamentali legati al cloud computing. In questo corso vengono trattati vari argomenti, tra cui:</p>\n<ul>\n<li>Fondamenti del cloud</li>\n<li>Concetti del cloud</li>\n<li>Architettura del cloud</li>\n<li>Modelli di distribuzione del cloud</li>\n<li>Panoramica dei servizi core di AWS</li>\n<li>Panoramica dei servizi AWS</li>\n<li>Fatturazione, prezzi e supporto dei servizi AWS</li>\n</ul>\n<p>Questa certificazione è spesso abbreviata in CCP, ed è particolarmente utile per coloro che vogliono iniziare a comprendere il mondo del cloud computing e acquisire una conoscenza base di AWS (o nella cloud industry).</p>\n<h2 id=\"chi-dovrebbe-prendere-questa-certificazione%3F\">Chi dovrebbe prendere questa certificazione? <a class=\"heading-anchor-permalink\" href=\"#chi-dovrebbe-prendere-questa-certificazione%3F\">#</a></h2>\n<p>La certificazione AWS Cloud Practitioner è pensata per diverse categorie di persone:</p>\n<ul>\n<li>Chi è nuovo al mondo del cloud computing e ha bisogno di imparare le basi.</li>\n<li>Esecutivi, responsabili o venditori che necessitano di una comprensione strategica del cloud per supportare l’adozione o la migrazione.</li>\n<li>Ingegneri senior specializzati nel cloud o architetti delle soluzioni che vogliono rinfrescare le loro conoscenze dopo anni di esperienza.</li>\n</ul>\n<h2 id=\"valore-della-certificazione\">Valore della certificazione <a class=\"heading-anchor-permalink\" href=\"#valore-della-certificazione\">#</a></h2>\n<p>La certificazione AWS Cloud Practitioner offre una panoramica approfondita dell’architettura del cloud e dei servizi offerti da AWS. Questa certificazione può essere un punto di partenza ideale per chiunque voglia entrare nel mondo della tecnologia cloud.</p>\n<p>Ecco una roadmap delle certificazioni AWS:</p>\n<p><img src=\"https://github.com/Elpiu/MindMemoir/blob/main/docs/AWS%20CLF-C01%20(AWS%20Cloud%20Practitioner)/imgs/image-roadmap-aws.png?raw=true\" alt=\"Roadmap\"></p>\n<h2 id=\"tempo-di-studio-consigliato\">Tempo di studio consigliato <a class=\"heading-anchor-permalink\" href=\"#tempo-di-studio-consigliato\">#</a></h2>\n<p>Per prepararsi all’esame AWS Cloud Practitioner, è raccomandato dedicare in media 24 ore di studio, distribuite idealmente nell’arco di 1-2 ore al giorno per 14 giorni.</p>\n<h2 id=\"guida-all%E2%80%99esame\">Guida all’esame <a class=\"heading-anchor-permalink\" href=\"#guida-all%E2%80%99esame\">#</a></h2>\n<p>L’esame è suddiviso in 4 domini, ognuno con un peso diverso nella valutazione finale:</p>\n<p><strong>26%</strong>: Dominio 1 - Concetti del Cloud</p>\n<p><strong>25%</strong>: Dominio 2 - Sicurezza e Conformità</p>\n<p><strong>33%</strong>: Dominio 3 - Tecnologia</p>\n<p><strong>16%</strong>: Dominio 4 - Fatturazione e Prezzi</p>\n<p>Alcuni dettagli sull’esame:</p>\n<ul>\n<li>Per superare l’esame è necessario totalizzare almeno 700 punti su 1000.</li>\n<li>L’esame consiste in 65 domande, di cui 50 con valore e 15 senza valore (utilizzate per misurare la difficoltà).</li>\n<li>Non ci sono penalità per risposte errate.</li>\n<li>Le domande possono avere una o più risposte corrette.</li>\n<li>Il tempo totale a disposizione per l’esame è 90 minuti.</li>\n<li>La certificazione ha una validità di 36 mesi.</li>\n</ul>\n<p>Nota: Tieni presente che alcune di queste informazioni potrebbero subire variazioni nel corso del tempo. Pertanto, è consigliabile fare riferimento alle fonti aggiornate, poiché le informazioni datate qui si riferiscono al periodo intorno al 2022.</p>\n<h3 id=\"videocorso-youtube-by-andrew-brown\"><a href=\"https://www.youtube.com/watch?v=SOTamWNgDKc\">Videocorso Youtube by Andrew Brown</a> <a class=\"heading-anchor-permalink\" href=\"#videocorso-youtube-by-andrew-brown\">#</a></h3>\n",
      "id": 1
    },
    {
      "path": "01-Cloud e AWS.md",
      "url": "01-Cloud e AWS.html",
      "content": "# Cloud e AWS\r\n\r\n## Cos'è il Cloud Computing?\r\n\r\nIl \"Cloud Computing\" è la pratica di utilizzare una rete di server remoti ospitati su Internet per archiviare, gestire ed elaborare dati, anziché fare affidamento su un server locale o un personal computer.\r\n\r\n\r\n### On-Premise\r\n\r\n- Possiedi i server\r\n- Assumi il personale IT\r\n- Paghi l'immobile o ne affitti uno\r\n- Affronti tutti i rischi\r\n\r\n\r\n### Cloud Providers\r\n\r\n- Qualcun altro possiede i server\r\n- Qualcun altro assume il personale IT\r\n- Qualcun altro paga o affitta l'immobile\r\n- Tu sei responsabile della configurazione dei servizi cloud e del codice, mentre qualcun altro si occupa del resto\r\n\r\n\r\n## L'evoluzione dell'Hosting Cloud\r\n\r\n- **Dedicate Server**: Una singola macchina fisica dedicata a un singolo business. Esegue un'unica applicazione web o sito. (Costoso, richiede molta manutenzione, alta sicurezza)\r\n\r\n<!---->\r\n\r\n- **Virtual Private Server (VPS)**: Una singola macchina fisica dedicata a un singolo business, ma virtualizzata in sottounità. Esegue più applicazioni web/siti. (Migliore utilizzo e isolamento delle risorse)\r\n\r\n<!---->\r\n\r\n- **Shared Hosting**: Una singola macchina fisica condivisa da centinaia di business affittuari che ne utilizzano le risorse. (Economico, funzionalità limitate, scarso isolamento)\r\n\r\n<!---->\r\n\r\n- **Cloud Hosting**: Più macchine fisiche che operano come un singolo sistema, astratto in diversi servizi cloud. (Flessibile, scalabile, sicuro, conveniente, alta configurabilità)\r\n\r\n\r\n## Cos'è AWS?\r\n\r\nAWS è un fornitore di servizi cloud, una raccolta di servizi cloud che possono essere utilizzati insieme attraverso un'unica API unificata per costruire workload.\r\n\r\n\r\n## Cos'è un Cloud Service Provider (CSP)?\r\n\r\nUn Cloud Service Provider (CSP) è un'azienda che offre una vasta gamma di servizi cloud. Ecco alcuni punti chiave che caratterizzano un CSP:\r\n\r\n**Offerta di Servizi Cloud**: I CSP offrono una varietà di servizi cloud, che possono andare da una decina a centinaia di servizi differenti.\r\n\r\n**Architettura Cloud**: Questi servizi cloud possono essere combinati insieme per creare un'architettura cloud personalizzata per le esigenze del cliente.\r\n\r\n**API Unificata**: Gli utenti possono accedere a questi servizi attraverso una singola API unificata, semplificando notevolmente l'interazione con i servizi.\r\n\r\n**Billing a Consumo**: La fatturazione dei servizi cloud è basata sull'uso effettivo, misurato in unità come secondi, ore, numero di CPU, spazio di archiviazione, ecc.\r\n\r\n**Sistema di Monitoraggio**: I CSP incorporano sistemi di monitoraggio avanzati all'interno dei loro servizi, come ad esempio AWS CloudTrail, per tracciare e registrare le attività.\r\n\r\n**Infrastruttura come Servizio (IaaS)**: Forniscono servizi cloud che includono infrastruttura come servizio, consentendo agli utenti di utilizzare risorse di rete, computer, e spazio di archiviazione su richiesta.\r\n\r\n**Automazioni Infrastructure as Code (IaC)**: I CSP spesso supportano approcci di automazione basati su codice per la gestione delle risorse cloud.\r\n\r\n\r\n### Livelli di CSP\r\n\r\nEsistono diverse categorie di CSP, suddivise in tre livelli principali:\r\n\r\n**Tier-1**: CSP di primo livello, tra cui Amazon Web Service, Microsoft Azure, Google Cloud Platform e Alibaba Cloud. Sono noti per la vasta gamma di servizi e la presenza globale.\r\n\r\n**Tier-2**: CSP di secondo livello, tra cui IBM Cloud, Oracle Cloud e Rackspace. Offrono una serie di servizi cloud ma potrebbero avere una presenza meno estesa rispetto ai Tier-1.\r\n\r\n**Tier-3**: CSP di terzo livello, come Vultr, Digital Ocean e Linode. Sono spesso noti per la semplicità e l'accessibilità dei loro servizi cloud.\r\n\r\n\r\n### Tipi di Servizi Cloud Principali\r\n\r\nI CSP offrono una varietà di servizi cloud, ma ci sono quattro tipi principali di servizi cloud, noti come i \"4 core\" per l'infrastruttura come servizio (IaaS):\r\n\r\n**Compute**: Fornisce macchine virtuali in cui è possibile eseguire applicazioni, programmi e codice.\r\n\r\n**Networking**: Offre servizi di rete, tra cui reti virtuali o reti isolate per collegare servizi o fornire connettività verso Internet.\r\n\r\n**Storage**: Mette a disposizione spazio di archiviazione virtuale per salvare file e dati.\r\n\r\n**Databases**: Fornisce database virtuali per l'archiviazione e la gestione di dati, da report a database di uso generale per applicazioni web.\r\n\r\nÈ importante notare che il termine \"Cloud Computing\" può essere utilizzato in riferimento a tutte queste categorie, anche se il termine \"Compute\" è incluso nel nome.\r\n\r\n\r\n## Tipi di Cloud Computing\r\n\r\n**SaaS (Software as a Service)**: Questo è rivolto ai clienti. Si tratta di un prodotto gestito dal provider del servizio. Gli utenti non devono preoccuparsi di come viene mantenuto il servizio. Funziona e rimane disponibile per l'uso.\r\n\r\n**PaaS (Platform as a Service)**: Questo è rivolto agli sviluppatori. Il focus è sul deployment e sulla gestione delle applicazioni. Gli sviluppatori non devono preoccuparsi dell'approvvigionamento, della configurazione o dell'infrastruttura sottostante, come hardware o sistema operativo.\r\n\r\n**IaaS (Infrastructure as a Service)**: Questo è rivolto agli amministratori IT. Fornisce funzionalità di networking, computer e spazio di archiviazione. È il fondamento principale per la gestione dell'infrastruttura cloud.\r\n\r\n\r\n## Modelli di Distribuzione del Cloud Computing\r\n\r\n**Public Cloud**: In questa modalità, tutto, dall'ambiente di lavoro ai progetti, è costruito su un CSP (Cloud Service Provider). Questo è spesso chiamato approccio \"Cloud-Native\" o \"Cloud First\".\r\n\r\n**Private Cloud**: In questo caso, tutto è costruito all'interno del datacenter di un'azienda, spesso chiamato anche approccio \"On-Premise\".\r\n\r\n**Hybrid**: Questo modello combina sia l'infrastruttura cloud sia l'infrastruttura on-premise. Gli utenti utilizzano entrambi in base alle esigenze.\r\n\r\n**Cross-Cloud**: In questo modello, vengono utilizzati più CSP diversi, noto anche come \"Multi-cloud\".\r\n\r\n\r\n## I Vantaggi del Cloud\r\n\r\n**Agilità**: Migliorare la velocità e l'agilità operativa.\r\n\r\n**Pricing Pay-as-You-Go**: Cambiare da costi iniziali a una spesa variabile basata sull'uso effettivo.\r\n\r\n**Economie di Scala**: Beneficiare delle economie di scala offerte dai grandi CSP.\r\n\r\n**Raggiungibilità Globale**: Distribuire servizi globalmente in pochi minuti.\r\n\r\n**Sicurezza**: Sicurezza fisica fornita dal cloud, ma possibilità di personalizzare le configurazioni di sicurezza.\r\n\r\n**Affidabilità**: Disponibilità di backup, ripristino da disastro, replicazione dati e tolleranza ai guasti.\r\n\r\n**Scalabilità**: Aumentare o diminuire risorse e servizi in base alle necessità.\r\n\r\n**Elasticità**: Scalare automaticamente durante i picchi e i cali della domanda.\r\n\r\n**Fault Tolerance**: La capacità di un sistema cloud di tollerare guasti hardware o software senza subire interruzioni significative dei servizi. Ciò contribuisce a garantire la continuità operativa e la disponibilità dei servizi anche in caso di problemi tecnici.\r\n\r\n**Disaster Recovery**: La capacità di ripristinare rapidamente i dati e i servizi in caso di eventi catastrofici o perdite di dati. Il cloud offre soluzioni di disaster recovery efficaci che consentono di proteggere i dati e ripristinare i servizi in tempi brevi.\r\n",
      "html": "<h1 id=\"cloud-e-aws\">Cloud e AWS <a class=\"heading-anchor-permalink\" href=\"#cloud-e-aws\">#</a></h1>\n<h2 id=\"cos%E2%80%99%C3%A8-il-cloud-computing%3F\">Cos’è il Cloud Computing? <a class=\"heading-anchor-permalink\" href=\"#cos%E2%80%99%C3%A8-il-cloud-computing%3F\">#</a></h2>\n<p>Il “Cloud Computing” è la pratica di utilizzare una rete di server remoti ospitati su Internet per archiviare, gestire ed elaborare dati, anziché fare affidamento su un server locale o un personal computer.</p>\n<h3 id=\"on-premise\">On-Premise <a class=\"heading-anchor-permalink\" href=\"#on-premise\">#</a></h3>\n<ul>\n<li>Possiedi i server</li>\n<li>Assumi il personale IT</li>\n<li>Paghi l’immobile o ne affitti uno</li>\n<li>Affronti tutti i rischi</li>\n</ul>\n<h3 id=\"cloud-providers\">Cloud Providers <a class=\"heading-anchor-permalink\" href=\"#cloud-providers\">#</a></h3>\n<ul>\n<li>Qualcun altro possiede i server</li>\n<li>Qualcun altro assume il personale IT</li>\n<li>Qualcun altro paga o affitta l’immobile</li>\n<li>Tu sei responsabile della configurazione dei servizi cloud e del codice, mentre qualcun altro si occupa del resto</li>\n</ul>\n<h2 id=\"l%E2%80%99evoluzione-dell%E2%80%99hosting-cloud\">L’evoluzione dell’Hosting Cloud <a class=\"heading-anchor-permalink\" href=\"#l%E2%80%99evoluzione-dell%E2%80%99hosting-cloud\">#</a></h2>\n<ul>\n<li><strong>Dedicate Server</strong>: Una singola macchina fisica dedicata a un singolo business. Esegue un’unica applicazione web o sito. (Costoso, richiede molta manutenzione, alta sicurezza)</li>\n</ul>\n<!---->\n<ul>\n<li><strong>Virtual Private Server (VPS)</strong>: Una singola macchina fisica dedicata a un singolo business, ma virtualizzata in sottounità. Esegue più applicazioni web/siti. (Migliore utilizzo e isolamento delle risorse)</li>\n</ul>\n<!---->\n<ul>\n<li><strong>Shared Hosting</strong>: Una singola macchina fisica condivisa da centinaia di business affittuari che ne utilizzano le risorse. (Economico, funzionalità limitate, scarso isolamento)</li>\n</ul>\n<!---->\n<ul>\n<li><strong>Cloud Hosting</strong>: Più macchine fisiche che operano come un singolo sistema, astratto in diversi servizi cloud. (Flessibile, scalabile, sicuro, conveniente, alta configurabilità)</li>\n</ul>\n<h2 id=\"cos%E2%80%99%C3%A8-aws%3F\">Cos’è AWS? <a class=\"heading-anchor-permalink\" href=\"#cos%E2%80%99%C3%A8-aws%3F\">#</a></h2>\n<p>AWS è un fornitore di servizi cloud, una raccolta di servizi cloud che possono essere utilizzati insieme attraverso un’unica API unificata per costruire workload.</p>\n<h2 id=\"cos%E2%80%99%C3%A8-un-cloud-service-provider-(csp)%3F\">Cos’è un Cloud Service Provider (CSP)? <a class=\"heading-anchor-permalink\" href=\"#cos%E2%80%99%C3%A8-un-cloud-service-provider-(csp)%3F\">#</a></h2>\n<p>Un Cloud Service Provider (CSP) è un’azienda che offre una vasta gamma di servizi cloud. Ecco alcuni punti chiave che caratterizzano un CSP:</p>\n<p><strong>Offerta di Servizi Cloud</strong>: I CSP offrono una varietà di servizi cloud, che possono andare da una decina a centinaia di servizi differenti.</p>\n<p><strong>Architettura Cloud</strong>: Questi servizi cloud possono essere combinati insieme per creare un’architettura cloud personalizzata per le esigenze del cliente.</p>\n<p><strong>API Unificata</strong>: Gli utenti possono accedere a questi servizi attraverso una singola API unificata, semplificando notevolmente l’interazione con i servizi.</p>\n<p><strong>Billing a Consumo</strong>: La fatturazione dei servizi cloud è basata sull’uso effettivo, misurato in unità come secondi, ore, numero di CPU, spazio di archiviazione, ecc.</p>\n<p><strong>Sistema di Monitoraggio</strong>: I CSP incorporano sistemi di monitoraggio avanzati all’interno dei loro servizi, come ad esempio AWS CloudTrail, per tracciare e registrare le attività.</p>\n<p><strong>Infrastruttura come Servizio (IaaS)</strong>: Forniscono servizi cloud che includono infrastruttura come servizio, consentendo agli utenti di utilizzare risorse di rete, computer, e spazio di archiviazione su richiesta.</p>\n<p><strong>Automazioni Infrastructure as Code (IaC)</strong>: I CSP spesso supportano approcci di automazione basati su codice per la gestione delle risorse cloud.</p>\n<h3 id=\"livelli-di-csp\">Livelli di CSP <a class=\"heading-anchor-permalink\" href=\"#livelli-di-csp\">#</a></h3>\n<p>Esistono diverse categorie di CSP, suddivise in tre livelli principali:</p>\n<p><strong>Tier-1</strong>: CSP di primo livello, tra cui Amazon Web Service, Microsoft Azure, Google Cloud Platform e Alibaba Cloud. Sono noti per la vasta gamma di servizi e la presenza globale.</p>\n<p><strong>Tier-2</strong>: CSP di secondo livello, tra cui IBM Cloud, Oracle Cloud e Rackspace. Offrono una serie di servizi cloud ma potrebbero avere una presenza meno estesa rispetto ai Tier-1.</p>\n<p><strong>Tier-3</strong>: CSP di terzo livello, come Vultr, Digital Ocean e Linode. Sono spesso noti per la semplicità e l’accessibilità dei loro servizi cloud.</p>\n<h3 id=\"tipi-di-servizi-cloud-principali\">Tipi di Servizi Cloud Principali <a class=\"heading-anchor-permalink\" href=\"#tipi-di-servizi-cloud-principali\">#</a></h3>\n<p>I CSP offrono una varietà di servizi cloud, ma ci sono quattro tipi principali di servizi cloud, noti come i “4 core” per l’infrastruttura come servizio (IaaS):</p>\n<p><strong>Compute</strong>: Fornisce macchine virtuali in cui è possibile eseguire applicazioni, programmi e codice.</p>\n<p><strong>Networking</strong>: Offre servizi di rete, tra cui reti virtuali o reti isolate per collegare servizi o fornire connettività verso Internet.</p>\n<p><strong>Storage</strong>: Mette a disposizione spazio di archiviazione virtuale per salvare file e dati.</p>\n<p><strong>Databases</strong>: Fornisce database virtuali per l’archiviazione e la gestione di dati, da report a database di uso generale per applicazioni web.</p>\n<p>È importante notare che il termine “Cloud Computing” può essere utilizzato in riferimento a tutte queste categorie, anche se il termine “Compute” è incluso nel nome.</p>\n<h2 id=\"tipi-di-cloud-computing\">Tipi di Cloud Computing <a class=\"heading-anchor-permalink\" href=\"#tipi-di-cloud-computing\">#</a></h2>\n<p><strong>SaaS (Software as a Service)</strong>: Questo è rivolto ai clienti. Si tratta di un prodotto gestito dal provider del servizio. Gli utenti non devono preoccuparsi di come viene mantenuto il servizio. Funziona e rimane disponibile per l’uso.</p>\n<p><strong>PaaS (Platform as a Service)</strong>: Questo è rivolto agli sviluppatori. Il focus è sul deployment e sulla gestione delle applicazioni. Gli sviluppatori non devono preoccuparsi dell’approvvigionamento, della configurazione o dell’infrastruttura sottostante, come hardware o sistema operativo.</p>\n<p><strong>IaaS (Infrastructure as a Service)</strong>: Questo è rivolto agli amministratori IT. Fornisce funzionalità di networking, computer e spazio di archiviazione. È il fondamento principale per la gestione dell’infrastruttura cloud.</p>\n<h2 id=\"modelli-di-distribuzione-del-cloud-computing\">Modelli di Distribuzione del Cloud Computing <a class=\"heading-anchor-permalink\" href=\"#modelli-di-distribuzione-del-cloud-computing\">#</a></h2>\n<p><strong>Public Cloud</strong>: In questa modalità, tutto, dall’ambiente di lavoro ai progetti, è costruito su un CSP (Cloud Service Provider). Questo è spesso chiamato approccio “Cloud-Native” o “Cloud First”.</p>\n<p><strong>Private Cloud</strong>: In questo caso, tutto è costruito all’interno del datacenter di un’azienda, spesso chiamato anche approccio “On-Premise”.</p>\n<p><strong>Hybrid</strong>: Questo modello combina sia l’infrastruttura cloud sia l’infrastruttura on-premise. Gli utenti utilizzano entrambi in base alle esigenze.</p>\n<p><strong>Cross-Cloud</strong>: In questo modello, vengono utilizzati più CSP diversi, noto anche come “Multi-cloud”.</p>\n<h2 id=\"i-vantaggi-del-cloud\">I Vantaggi del Cloud <a class=\"heading-anchor-permalink\" href=\"#i-vantaggi-del-cloud\">#</a></h2>\n<p><strong>Agilità</strong>: Migliorare la velocità e l’agilità operativa.</p>\n<p><strong>Pricing Pay-as-You-Go</strong>: Cambiare da costi iniziali a una spesa variabile basata sull’uso effettivo.</p>\n<p><strong>Economie di Scala</strong>: Beneficiare delle economie di scala offerte dai grandi CSP.</p>\n<p><strong>Raggiungibilità Globale</strong>: Distribuire servizi globalmente in pochi minuti.</p>\n<p><strong>Sicurezza</strong>: Sicurezza fisica fornita dal cloud, ma possibilità di personalizzare le configurazioni di sicurezza.</p>\n<p><strong>Affidabilità</strong>: Disponibilità di backup, ripristino da disastro, replicazione dati e tolleranza ai guasti.</p>\n<p><strong>Scalabilità</strong>: Aumentare o diminuire risorse e servizi in base alle necessità.</p>\n<p><strong>Elasticità</strong>: Scalare automaticamente durante i picchi e i cali della domanda.</p>\n<p><strong>Fault Tolerance</strong>: La capacità di un sistema cloud di tollerare guasti hardware o software senza subire interruzioni significative dei servizi. Ciò contribuisce a garantire la continuità operativa e la disponibilità dei servizi anche in caso di problemi tecnici.</p>\n<p><strong>Disaster Recovery</strong>: La capacità di ripristinare rapidamente i dati e i servizi in caso di eventi catastrofici o perdite di dati. Il cloud offre soluzioni di disaster recovery efficaci che consentono di proteggere i dati e ripristinare i servizi in tempi brevi.</p>\n",
      "id": 2
    },
    {
      "path": "workingOn.md",
      "url": "workingOn.html",
      "content": "\r\n\r\n### AWS Global Infrastrucutre\r\nGlobal Infrastructure: sono delle strutture globali hardware e datacenters connesse fisicamente dalla rete, per agire come un unica grande risorsa all'utente finale.\r\nAWS Global Infrastructures is made up of the following resources:\r\n- 25 Launched Regions\r\n- 81 Availability Zone\r\n- 108 Direct Connection Locations\r\n- 275+ Point of Presence\r\n- 11 Local Zone\r\n- 17 Wavelenght Zone\r\n\r\n### Regions\r\nLe regioni sono are geografiche distinte, consistono in una o più Availability Zones\r\n\r\nOgni regione di solito ha 3 Availability Zones\r\nI nuovi utenti sono limitati a 2.\r\nI nuovi servizi quasi sempre vengono resi disponibili alla 1.\r\nNon tutti i servizi AWS sono disponibili in tutte le regioni.\r\nIl costo per i servizi AWS variano per regione.\r\n\r\nQuando si sceglie una regione ci sono 4 fattori da tenere in considerazione:\r\n\r\n1) La regolamentazione della regione\r\n2) Il costo dei servizi AWS in quella regione\r\n3) I servizi disponibili in quella regione\r\n4) La distanza o latenza all'utente finale\r\n\r\n### Availability Zones (AZ)\r\nUna zona di disponibilità è una zona fisica dove sono presenti uno o più datacenter.\r\n\r\nUn datacenter è un edeificio sicuro che contiente centinaia di migliaia di computers.\r\n\r\nUna regione di solito contiente 3 AZ, i datacenters sono isolati (in edifici differenti), ma sono abbastanza vicini da abbassare la latenza a (<10ms). è una pratica comune lanciare workloads in almeno 3 AZs per essere sicuri che il servizio rimanga accessibile in caso di uno o due datacenter non disponibili (Hight Availability).\r\n\r\nUna sottorete (subnet) è associata a un AZ.\r\nNon sceglierai mai l'AZ quando lanci le risorse,\r\nquello che sceglierai è la sottorete.\r\n\r\n\r\n### Fault Tolerance\r\n\r\n##### Fault Domain\r\nUn fault domain è una sezione della rete che è vulnerabile a un fail di sistema o danno di un device.  Lo scopo del fault domain è che se accade una failure, essa non farà cadere in cascata il dominio, limitando il danno il più possibile.\r\n\r\nSi possono avere fault domain innestate in altre fault domain.\r\n\r\nSi parla di fault level, quando si hanno diversi livelli di fault, una collezione di fault domains. \r\nGli scope possono essere: uno specifico server in un rack, un intero rack in un datacenter, un intera stanza in un datacenter, l'intero datacenter.\r\nSta al CSP definire i confini del dominio.\r\n\r\nOgni regione amazon è designata per esser completamente isolata dalle altre Regioni amazon. Questo fa si che si abbia la maggior possibilità di dault tolerance e stability. Ogni AZ è isolata ma connessa con link low-latency alle altre regioni, e ogni regione ha un suo piano indipendente di failure zone.\r\n\r\n#### Failure zone\r\nOgni AZ è fisicamente separata dalle altre e tipicamente in altre cittò, queste sono localizzate in are poco a ricschio (esempio alluvione).\r\nOgni AZ ha la sua UPS uninterruptible power supply e un suo sito di backup per generare energia.\r\nLe AZ sono localizzate in zone indipendenti da altre AZ dall'infrastruttura della rete elettrica in modo da evitare eventi di blackout.\r\nLe AZ sono connesse in modo ridondante a provider tier-1.\r\n\r\n### Global Network\r\n\r\n",
      "html": "<h3 id=\"aws-global-infrastrucutre\">AWS Global Infrastrucutre <a class=\"heading-anchor-permalink\" href=\"#aws-global-infrastrucutre\">#</a></h3>\n<p>Global Infrastructure: sono delle strutture globali hardware e datacenters connesse fisicamente dalla rete, per agire come un unica grande risorsa all’utente finale.\nAWS Global Infrastructures is made up of the following resources:</p>\n<ul>\n<li>25 Launched Regions</li>\n<li>81 Availability Zone</li>\n<li>108 Direct Connection Locations</li>\n<li>275+ Point of Presence</li>\n<li>11 Local Zone</li>\n<li>17 Wavelenght Zone</li>\n</ul>\n<h3 id=\"regions\">Regions <a class=\"heading-anchor-permalink\" href=\"#regions\">#</a></h3>\n<p>Le regioni sono are geografiche distinte, consistono in una o più Availability Zones</p>\n<p>Ogni regione di solito ha 3 Availability Zones\nI nuovi utenti sono limitati a 2.\nI nuovi servizi quasi sempre vengono resi disponibili alla 1.\nNon tutti i servizi AWS sono disponibili in tutte le regioni.\nIl costo per i servizi AWS variano per regione.</p>\n<p>Quando si sceglie una regione ci sono 4 fattori da tenere in considerazione:</p>\n<ol>\n<li>La regolamentazione della regione</li>\n<li>Il costo dei servizi AWS in quella regione</li>\n<li>I servizi disponibili in quella regione</li>\n<li>La distanza o latenza all’utente finale</li>\n</ol>\n<h3 id=\"availability-zones-(az)\">Availability Zones (AZ) <a class=\"heading-anchor-permalink\" href=\"#availability-zones-(az)\">#</a></h3>\n<p>Una zona di disponibilità è una zona fisica dove sono presenti uno o più datacenter.</p>\n<p>Un datacenter è un edeificio sicuro che contiente centinaia di migliaia di computers.</p>\n<p>Una regione di solito contiente 3 AZ, i datacenters sono isolati (in edifici differenti), ma sono abbastanza vicini da abbassare la latenza a (&lt;10ms). è una pratica comune lanciare workloads in almeno 3 AZs per essere sicuri che il servizio rimanga accessibile in caso di uno o due datacenter non disponibili (Hight Availability).</p>\n<p>Una sottorete (subnet) è associata a un AZ.\nNon sceglierai mai l’AZ quando lanci le risorse,\nquello che sceglierai è la sottorete.</p>\n<h3 id=\"fault-tolerance\">Fault Tolerance <a class=\"heading-anchor-permalink\" href=\"#fault-tolerance\">#</a></h3>\n<h5 id=\"fault-domain\">Fault Domain <a class=\"heading-anchor-permalink\" href=\"#fault-domain\">#</a></h5>\n<p>Un fault domain è una sezione della rete che è vulnerabile a un fail di sistema o danno di un device.  Lo scopo del fault domain è che se accade una failure, essa non farà cadere in cascata il dominio, limitando il danno il più possibile.</p>\n<p>Si possono avere fault domain innestate in altre fault domain.</p>\n<p>Si parla di fault level, quando si hanno diversi livelli di fault, una collezione di fault domains.\nGli scope possono essere: uno specifico server in un rack, un intero rack in un datacenter, un intera stanza in un datacenter, l’intero datacenter.\nSta al CSP definire i confini del dominio.</p>\n<p>Ogni regione amazon è designata per esser completamente isolata dalle altre Regioni amazon. Questo fa si che si abbia la maggior possibilità di dault tolerance e stability. Ogni AZ è isolata ma connessa con link low-latency alle altre regioni, e ogni regione ha un suo piano indipendente di failure zone.</p>\n<h4 id=\"failure-zone\">Failure zone <a class=\"heading-anchor-permalink\" href=\"#failure-zone\">#</a></h4>\n<p>Ogni AZ è fisicamente separata dalle altre e tipicamente in altre cittò, queste sono localizzate in are poco a ricschio (esempio alluvione).\nOgni AZ ha la sua UPS uninterruptible power supply e un suo sito di backup per generare energia.\nLe AZ sono localizzate in zone indipendenti da altre AZ dall’infrastruttura della rete elettrica in modo da evitare eventi di blackout.\nLe AZ sono connesse in modo ridondante a provider tier-1.</p>\n<h3 id=\"global-network\">Global Network <a class=\"heading-anchor-permalink\" href=\"#global-network\">#</a></h3>\n",
      "id": 3
    }
  ]
}