{
  "paths": [
    {
      "type": "file",
      "value": "00-A Glossario.md"
    },
    {
      "type": "file",
      "value": "00-Intro.md"
    },
    {
      "type": "file",
      "value": "01-Cloud e AWS.md"
    },
    {
      "type": "file",
      "value": "02-AWS Infrastructure.md"
    },
    {
      "type": "file",
      "value": "workingCloudArchitecture Terminologies.md"
    }
  ],
  "contents": [
    {
      "path": "00-A Glossario.md",
      "url": "00-A Glossario.html",
      "content": "# Glossario\r\n\r\n### Tenant \r\n\r\nUn \"tenant\" è un gruppo di utenti che condividono un accesso comune con privilegi specifici per un'istanza di software. L'architettura multi-tenancy è un modello in cui una singola istanza di un'applicazione software serve a diversi clienti. Ciascun cliente è chiamato \"tenant\".\r\n\r\n\r\n### Workload\r\n\r\nUna \"cloud workload\" è una specifica applicazione, servizio, capacità o quantità di lavoro che può essere eseguita su una risorsa cloud. Tra le \"cloud workloads\" rientrano le macchine virtuali, i database, i container, i nodi Hadoop e le applicazioni.\r\n\r\n\r\n### Server Rack\r\n\r\nUn server rack è un telaio progettato per ospitare e organizzare l'attrezzatura IT, inclusi server, switch, router, unità di archiviazione e altri dispositivi hardware. I rack sono progettati per consentire l'installazione sicura e ordinata di questi componenti, semplificando la gestione e la manutenzione dell'infrastruttura IT. Quando si parla di AWS Outposts, si fa riferimento a un rack di server fisici che vengono forniti da Amazon e che eseguono l'infrastruttura AWS direttamente nella tua posizione fisica, consentendo di utilizzare servizi cloud AWS all'interno del tuo data center o ambiente on-premise.\r\n\r\n\r\n\r\n",
      "html": "<h1 id=\"glossario\">Glossario <a class=\"heading-anchor-permalink\" href=\"#glossario\">#</a></h1>\n<h3 id=\"tenant\">Tenant <a class=\"heading-anchor-permalink\" href=\"#tenant\">#</a></h3>\n<p>Un “tenant” è un gruppo di utenti che condividono un accesso comune con privilegi specifici per un’istanza di software. L’architettura multi-tenancy è un modello in cui una singola istanza di un’applicazione software serve a diversi clienti. Ciascun cliente è chiamato “tenant”.</p>\n<h3 id=\"workload\">Workload <a class=\"heading-anchor-permalink\" href=\"#workload\">#</a></h3>\n<p>Una “cloud workload” è una specifica applicazione, servizio, capacità o quantità di lavoro che può essere eseguita su una risorsa cloud. Tra le “cloud workloads” rientrano le macchine virtuali, i database, i container, i nodi Hadoop e le applicazioni.</p>\n<h3 id=\"server-rack\">Server Rack <a class=\"heading-anchor-permalink\" href=\"#server-rack\">#</a></h3>\n<p>Un server rack è un telaio progettato per ospitare e organizzare l’attrezzatura IT, inclusi server, switch, router, unità di archiviazione e altri dispositivi hardware. I rack sono progettati per consentire l’installazione sicura e ordinata di questi componenti, semplificando la gestione e la manutenzione dell’infrastruttura IT. Quando si parla di AWS Outposts, si fa riferimento a un rack di server fisici che vengono forniti da Amazon e che eseguono l’infrastruttura AWS direttamente nella tua posizione fisica, consentendo di utilizzare servizi cloud AWS all’interno del tuo data center o ambiente on-premise.</p>\n",
      "id": 0
    },
    {
      "path": "00-Intro.md",
      "url": "00-Intro.html",
      "content": "# Introduzione\r\n\r\n**AWS Cloud Practitioner** è una certificazione di livello base (entry-level) offerta da AWS che copre una serie di concetti fondamentali legati al cloud computing. In questo corso vengono trattati vari argomenti, tra cui:\r\n\r\n- Fondamenti del cloud\r\n- Concetti del cloud\r\n- Architettura del cloud\r\n- Modelli di distribuzione del cloud\r\n- Panoramica dei servizi core di AWS\r\n- Panoramica dei servizi AWS\r\n- Fatturazione, prezzi e supporto dei servizi AWS\r\n\r\nQuesta certificazione è spesso abbreviata in CCP, ed è particolarmente utile per coloro che vogliono iniziare a comprendere il mondo del cloud computing e acquisire una conoscenza base di AWS (o nella cloud industry).\r\n\r\n\r\n## Chi dovrebbe prendere questa certificazione?\r\n\r\nLa certificazione AWS Cloud Practitioner è pensata per diverse categorie di persone:\r\n\r\n- Chi è nuovo al mondo del cloud computing e ha bisogno di imparare le basi.\r\n- Esecutivi, responsabili o venditori che necessitano di una comprensione strategica del cloud per supportare l'adozione o la migrazione.\r\n- Ingegneri senior specializzati nel cloud o architetti delle soluzioni che vogliono rinfrescare le loro conoscenze dopo anni di esperienza.\r\n\r\n\r\n## Valore della certificazione\r\n\r\nLa certificazione AWS Cloud Practitioner offre una panoramica approfondita dell'architettura del cloud e dei servizi offerti da AWS. Questa certificazione può essere un punto di partenza ideale per chiunque voglia entrare nel mondo della tecnologia cloud.\r\n\r\nEcco una roadmap delle certificazioni AWS:\r\n\r\n![Roadmap](https://github.com/Elpiu/MindMemoir/blob/main/docs/AWS%20CLF-C01%20(AWS%20Cloud%20Practitioner)/imgs/image-roadmap-aws.png?raw=true)\r\n\r\n\r\n## Tempo di studio consigliato\r\n\r\nPer prepararsi all'esame AWS Cloud Practitioner, è raccomandato dedicare in media 24 ore di studio, distribuite idealmente nell'arco di 1-2 ore al giorno per 14 giorni.\r\n\r\n\r\n## Guida all'esame\r\n\r\nL'esame è suddiviso in 4 domini, ognuno con un peso diverso nella valutazione finale:\r\n\r\n**26%**: Dominio 1 - Concetti del Cloud\r\n\r\n**25%**: Dominio 2 - Sicurezza e Conformità\r\n\r\n**33%**: Dominio 3 - Tecnologia\r\n\r\n**16%**: Dominio 4 - Fatturazione e Prezzi\r\n\r\nAlcuni dettagli sull'esame:\r\n\r\n- Per superare l'esame è necessario totalizzare almeno 700 punti su 1000.\r\n- L'esame consiste in 65 domande, di cui 50 con valore e 15 senza valore (utilizzate per misurare la difficoltà).\r\n- Non ci sono penalità per risposte errate.\r\n- Le domande possono avere una o più risposte corrette.\r\n- Il tempo totale a disposizione per l'esame è 90 minuti.\r\n- La certificazione ha una validità di 36 mesi.\r\n\r\nNota: Tieni presente che alcune di queste informazioni potrebbero subire variazioni nel corso del tempo. Pertanto, è consigliabile fare riferimento alle fonti aggiornate, poiché le informazioni datate qui si riferiscono al periodo intorno al 2022.\r\n\r\n\r\n### [Videocorso Youtube by Andrew Brown](https\\://www\\.youtube.com/watch?v=SOTamWNgDKc)\r\n",
      "html": "<h1 id=\"introduzione\">Introduzione <a class=\"heading-anchor-permalink\" href=\"#introduzione\">#</a></h1>\n<p><strong>AWS Cloud Practitioner</strong> è una certificazione di livello base (entry-level) offerta da AWS che copre una serie di concetti fondamentali legati al cloud computing. In questo corso vengono trattati vari argomenti, tra cui:</p>\n<ul>\n<li>Fondamenti del cloud</li>\n<li>Concetti del cloud</li>\n<li>Architettura del cloud</li>\n<li>Modelli di distribuzione del cloud</li>\n<li>Panoramica dei servizi core di AWS</li>\n<li>Panoramica dei servizi AWS</li>\n<li>Fatturazione, prezzi e supporto dei servizi AWS</li>\n</ul>\n<p>Questa certificazione è spesso abbreviata in CCP, ed è particolarmente utile per coloro che vogliono iniziare a comprendere il mondo del cloud computing e acquisire una conoscenza base di AWS (o nella cloud industry).</p>\n<h2 id=\"chi-dovrebbe-prendere-questa-certificazione%3F\">Chi dovrebbe prendere questa certificazione? <a class=\"heading-anchor-permalink\" href=\"#chi-dovrebbe-prendere-questa-certificazione%3F\">#</a></h2>\n<p>La certificazione AWS Cloud Practitioner è pensata per diverse categorie di persone:</p>\n<ul>\n<li>Chi è nuovo al mondo del cloud computing e ha bisogno di imparare le basi.</li>\n<li>Esecutivi, responsabili o venditori che necessitano di una comprensione strategica del cloud per supportare l’adozione o la migrazione.</li>\n<li>Ingegneri senior specializzati nel cloud o architetti delle soluzioni che vogliono rinfrescare le loro conoscenze dopo anni di esperienza.</li>\n</ul>\n<h2 id=\"valore-della-certificazione\">Valore della certificazione <a class=\"heading-anchor-permalink\" href=\"#valore-della-certificazione\">#</a></h2>\n<p>La certificazione AWS Cloud Practitioner offre una panoramica approfondita dell’architettura del cloud e dei servizi offerti da AWS. Questa certificazione può essere un punto di partenza ideale per chiunque voglia entrare nel mondo della tecnologia cloud.</p>\n<p>Ecco una roadmap delle certificazioni AWS:</p>\n<p><img src=\"https://github.com/Elpiu/MindMemoir/blob/main/docs/AWS%20CLF-C01%20(AWS%20Cloud%20Practitioner)/imgs/image-roadmap-aws.png?raw=true\" alt=\"Roadmap\"></p>\n<h2 id=\"tempo-di-studio-consigliato\">Tempo di studio consigliato <a class=\"heading-anchor-permalink\" href=\"#tempo-di-studio-consigliato\">#</a></h2>\n<p>Per prepararsi all’esame AWS Cloud Practitioner, è raccomandato dedicare in media 24 ore di studio, distribuite idealmente nell’arco di 1-2 ore al giorno per 14 giorni.</p>\n<h2 id=\"guida-all%E2%80%99esame\">Guida all’esame <a class=\"heading-anchor-permalink\" href=\"#guida-all%E2%80%99esame\">#</a></h2>\n<p>L’esame è suddiviso in 4 domini, ognuno con un peso diverso nella valutazione finale:</p>\n<p><strong>26%</strong>: Dominio 1 - Concetti del Cloud</p>\n<p><strong>25%</strong>: Dominio 2 - Sicurezza e Conformità</p>\n<p><strong>33%</strong>: Dominio 3 - Tecnologia</p>\n<p><strong>16%</strong>: Dominio 4 - Fatturazione e Prezzi</p>\n<p>Alcuni dettagli sull’esame:</p>\n<ul>\n<li>Per superare l’esame è necessario totalizzare almeno 700 punti su 1000.</li>\n<li>L’esame consiste in 65 domande, di cui 50 con valore e 15 senza valore (utilizzate per misurare la difficoltà).</li>\n<li>Non ci sono penalità per risposte errate.</li>\n<li>Le domande possono avere una o più risposte corrette.</li>\n<li>Il tempo totale a disposizione per l’esame è 90 minuti.</li>\n<li>La certificazione ha una validità di 36 mesi.</li>\n</ul>\n<p>Nota: Tieni presente che alcune di queste informazioni potrebbero subire variazioni nel corso del tempo. Pertanto, è consigliabile fare riferimento alle fonti aggiornate, poiché le informazioni datate qui si riferiscono al periodo intorno al 2022.</p>\n<h3 id=\"videocorso-youtube-by-andrew-brown\"><a href=\"https://www.youtube.com/watch?v=SOTamWNgDKc\">Videocorso Youtube by Andrew Brown</a> <a class=\"heading-anchor-permalink\" href=\"#videocorso-youtube-by-andrew-brown\">#</a></h3>\n",
      "id": 1
    },
    {
      "path": "01-Cloud e AWS.md",
      "url": "01-Cloud e AWS.html",
      "content": "# Cloud e AWS\r\n\r\n## Cos'è il Cloud Computing?\r\n\r\nIl \"Cloud Computing\" è la pratica di utilizzare una rete di server remoti ospitati su Internet per archiviare, gestire ed elaborare dati, anziché fare affidamento su un server locale o un personal computer.\r\n\r\n\r\n### On-Premise\r\n\r\n- Possiedi i server\r\n- Assumi il personale IT\r\n- Paghi l'immobile o ne affitti uno\r\n- Affronti tutti i rischi\r\n\r\n\r\n### Cloud Providers\r\n\r\n- Qualcun altro possiede i server\r\n- Qualcun altro assume il personale IT\r\n- Qualcun altro paga o affitta l'immobile\r\n- Tu sei responsabile della configurazione dei servizi cloud e del codice, mentre qualcun altro si occupa del resto\r\n\r\n\r\n## L'evoluzione dell'Hosting Cloud\r\n\r\n- **Dedicate Server**: Una singola macchina fisica dedicata a un singolo business. Esegue un'unica applicazione web o sito. (Costoso, richiede molta manutenzione, alta sicurezza)\r\n\r\n<!---->\r\n\r\n- **Virtual Private Server (VPS)**: Una singola macchina fisica dedicata a un singolo business, ma virtualizzata in sottounità. Esegue più applicazioni web/siti. (Migliore utilizzo e isolamento delle risorse)\r\n\r\n<!---->\r\n\r\n- **Shared Hosting**: Una singola macchina fisica condivisa da centinaia di business affittuari che ne utilizzano le risorse. (Economico, funzionalità limitate, scarso isolamento)\r\n\r\n<!---->\r\n\r\n- **Cloud Hosting**: Più macchine fisiche che operano come un singolo sistema, astratto in diversi servizi cloud. (Flessibile, scalabile, sicuro, conveniente, alta configurabilità)\r\n\r\n\r\n## Cos'è AWS?\r\n\r\nAWS è un fornitore di servizi cloud, una raccolta di servizi cloud che possono essere utilizzati insieme attraverso un'unica API unificata per costruire workload.\r\n\r\n\r\n## Cos'è un Cloud Service Provider (CSP)?\r\n\r\nUn Cloud Service Provider (CSP) è un'azienda che offre una vasta gamma di servizi cloud. Ecco alcuni punti chiave che caratterizzano un CSP:\r\n\r\n**Offerta di Servizi Cloud**: I CSP offrono una varietà di servizi cloud, che possono andare da una decina a centinaia di servizi differenti.\r\n\r\n**Architettura Cloud**: Questi servizi cloud possono essere combinati insieme per creare un'architettura cloud personalizzata per le esigenze del cliente.\r\n\r\n**API Unificata**: Gli utenti possono accedere a questi servizi attraverso una singola API unificata, semplificando notevolmente l'interazione con i servizi.\r\n\r\n**Billing a Consumo**: La fatturazione dei servizi cloud è basata sull'uso effettivo, misurato in unità come secondi, ore, numero di CPU, spazio di archiviazione, ecc.\r\n\r\n**Sistema di Monitoraggio**: I CSP incorporano sistemi di monitoraggio avanzati all'interno dei loro servizi, come ad esempio AWS CloudTrail, per tracciare e registrare le attività.\r\n\r\n**Infrastruttura come Servizio (IaaS)**: Forniscono servizi cloud che includono infrastruttura come servizio, consentendo agli utenti di utilizzare risorse di rete, computer, e spazio di archiviazione su richiesta.\r\n\r\n**Automazioni Infrastructure as Code (IaC)**: I CSP spesso supportano approcci di automazione basati su codice per la gestione delle risorse cloud.\r\n\r\n\r\n### Livelli di CSP\r\n\r\nEsistono diverse categorie di CSP, suddivise in tre livelli principali:\r\n\r\n**Tier-1**: CSP di primo livello, tra cui Amazon Web Service, Microsoft Azure, Google Cloud Platform e Alibaba Cloud. Sono noti per la vasta gamma di servizi e la presenza globale.\r\n\r\n**Tier-2**: CSP di secondo livello, tra cui IBM Cloud, Oracle Cloud e Rackspace. Offrono una serie di servizi cloud ma potrebbero avere una presenza meno estesa rispetto ai Tier-1.\r\n\r\n**Tier-3**: CSP di terzo livello, come Vultr, Digital Ocean e Linode. Sono spesso noti per la semplicità e l'accessibilità dei loro servizi cloud.\r\n\r\n\r\n### Tipi di Servizi Cloud Principali\r\n\r\nI CSP offrono una varietà di servizi cloud, ma ci sono quattro tipi principali di servizi cloud, noti come i \"4 core\" per l'infrastruttura come servizio (IaaS):\r\n\r\n**Compute**: Fornisce macchine virtuali in cui è possibile eseguire applicazioni, programmi e codice.\r\n\r\n**Networking**: Offre servizi di rete, tra cui reti virtuali o reti isolate per collegare servizi o fornire connettività verso Internet.\r\n\r\n**Storage**: Mette a disposizione spazio di archiviazione virtuale per salvare file e dati.\r\n\r\n**Databases**: Fornisce database virtuali per l'archiviazione e la gestione di dati, da report a database di uso generale per applicazioni web.\r\n\r\nÈ importante notare che il termine \"Cloud Computing\" può essere utilizzato in riferimento a tutte queste categorie, anche se il termine \"Compute\" è incluso nel nome.\r\n\r\n\r\n## Tipi di Cloud Computing\r\n\r\n**SaaS (Software as a Service)**: Questo è rivolto ai clienti. Si tratta di un prodotto gestito dal provider del servizio. Gli utenti non devono preoccuparsi di come viene mantenuto il servizio. Funziona e rimane disponibile per l'uso.\r\n\r\n**PaaS (Platform as a Service)**: Questo è rivolto agli sviluppatori. Il focus è sul deployment e sulla gestione delle applicazioni. Gli sviluppatori non devono preoccuparsi dell'approvvigionamento, della configurazione o dell'infrastruttura sottostante, come hardware o sistema operativo.\r\n\r\n**IaaS (Infrastructure as a Service)**: Questo è rivolto agli amministratori IT. Fornisce funzionalità di networking, computer e spazio di archiviazione. È il fondamento principale per la gestione dell'infrastruttura cloud.\r\n\r\n\r\n## Modelli di Distribuzione del Cloud Computing\r\n\r\n**Public Cloud**: In questa modalità, tutto, dall'ambiente di lavoro ai progetti, è costruito su un CSP (Cloud Service Provider). Questo è spesso chiamato approccio \"Cloud-Native\" o \"Cloud First\".\r\n\r\n**Private Cloud**: In questo caso, tutto è costruito all'interno del datacenter di un'azienda, spesso chiamato anche approccio \"On-Premise\".\r\n\r\n**Hybrid**: Questo modello combina sia l'infrastruttura cloud sia l'infrastruttura on-premise. Gli utenti utilizzano entrambi in base alle esigenze.\r\n\r\n**Cross-Cloud**: In questo modello, vengono utilizzati più CSP diversi, noto anche come \"Multi-cloud\".\r\n\r\n\r\n## I Vantaggi del Cloud\r\n\r\n**Agilità**: Migliorare la velocità e l'agilità operativa.\r\n\r\n**Pricing Pay-as-You-Go**: Cambiare da costi iniziali a una spesa variabile basata sull'uso effettivo.\r\n\r\n**Economie di Scala**: Beneficiare delle economie di scala offerte dai grandi CSP.\r\n\r\n**Raggiungibilità Globale**: Distribuire servizi globalmente in pochi minuti.\r\n\r\n**Sicurezza**: Sicurezza fisica fornita dal cloud, ma possibilità di personalizzare le configurazioni di sicurezza.\r\n\r\n**Affidabilità**: Disponibilità di backup, ripristino da disastro, replicazione dati e tolleranza ai guasti.\r\n\r\n**Scalabilità**: Aumentare o diminuire risorse e servizi in base alle necessità.\r\n\r\n**Elasticità**: Scalare automaticamente durante i picchi e i cali della domanda.\r\n\r\n**Fault Tolerance**: La capacità di un sistema cloud di tollerare guasti hardware o software senza subire interruzioni significative dei servizi. Ciò contribuisce a garantire la continuità operativa e la disponibilità dei servizi anche in caso di problemi tecnici.\r\n\r\n**Disaster Recovery**: La capacità di ripristinare rapidamente i dati e i servizi in caso di eventi catastrofici o perdite di dati. Il cloud offre soluzioni di disaster recovery efficaci che consentono di proteggere i dati e ripristinare i servizi in tempi brevi.\r\n",
      "html": "<h1 id=\"cloud-e-aws\">Cloud e AWS <a class=\"heading-anchor-permalink\" href=\"#cloud-e-aws\">#</a></h1>\n<h2 id=\"cos%E2%80%99%C3%A8-il-cloud-computing%3F\">Cos’è il Cloud Computing? <a class=\"heading-anchor-permalink\" href=\"#cos%E2%80%99%C3%A8-il-cloud-computing%3F\">#</a></h2>\n<p>Il “Cloud Computing” è la pratica di utilizzare una rete di server remoti ospitati su Internet per archiviare, gestire ed elaborare dati, anziché fare affidamento su un server locale o un personal computer.</p>\n<h3 id=\"on-premise\">On-Premise <a class=\"heading-anchor-permalink\" href=\"#on-premise\">#</a></h3>\n<ul>\n<li>Possiedi i server</li>\n<li>Assumi il personale IT</li>\n<li>Paghi l’immobile o ne affitti uno</li>\n<li>Affronti tutti i rischi</li>\n</ul>\n<h3 id=\"cloud-providers\">Cloud Providers <a class=\"heading-anchor-permalink\" href=\"#cloud-providers\">#</a></h3>\n<ul>\n<li>Qualcun altro possiede i server</li>\n<li>Qualcun altro assume il personale IT</li>\n<li>Qualcun altro paga o affitta l’immobile</li>\n<li>Tu sei responsabile della configurazione dei servizi cloud e del codice, mentre qualcun altro si occupa del resto</li>\n</ul>\n<h2 id=\"l%E2%80%99evoluzione-dell%E2%80%99hosting-cloud\">L’evoluzione dell’Hosting Cloud <a class=\"heading-anchor-permalink\" href=\"#l%E2%80%99evoluzione-dell%E2%80%99hosting-cloud\">#</a></h2>\n<ul>\n<li><strong>Dedicate Server</strong>: Una singola macchina fisica dedicata a un singolo business. Esegue un’unica applicazione web o sito. (Costoso, richiede molta manutenzione, alta sicurezza)</li>\n</ul>\n<!---->\n<ul>\n<li><strong>Virtual Private Server (VPS)</strong>: Una singola macchina fisica dedicata a un singolo business, ma virtualizzata in sottounità. Esegue più applicazioni web/siti. (Migliore utilizzo e isolamento delle risorse)</li>\n</ul>\n<!---->\n<ul>\n<li><strong>Shared Hosting</strong>: Una singola macchina fisica condivisa da centinaia di business affittuari che ne utilizzano le risorse. (Economico, funzionalità limitate, scarso isolamento)</li>\n</ul>\n<!---->\n<ul>\n<li><strong>Cloud Hosting</strong>: Più macchine fisiche che operano come un singolo sistema, astratto in diversi servizi cloud. (Flessibile, scalabile, sicuro, conveniente, alta configurabilità)</li>\n</ul>\n<h2 id=\"cos%E2%80%99%C3%A8-aws%3F\">Cos’è AWS? <a class=\"heading-anchor-permalink\" href=\"#cos%E2%80%99%C3%A8-aws%3F\">#</a></h2>\n<p>AWS è un fornitore di servizi cloud, una raccolta di servizi cloud che possono essere utilizzati insieme attraverso un’unica API unificata per costruire workload.</p>\n<h2 id=\"cos%E2%80%99%C3%A8-un-cloud-service-provider-(csp)%3F\">Cos’è un Cloud Service Provider (CSP)? <a class=\"heading-anchor-permalink\" href=\"#cos%E2%80%99%C3%A8-un-cloud-service-provider-(csp)%3F\">#</a></h2>\n<p>Un Cloud Service Provider (CSP) è un’azienda che offre una vasta gamma di servizi cloud. Ecco alcuni punti chiave che caratterizzano un CSP:</p>\n<p><strong>Offerta di Servizi Cloud</strong>: I CSP offrono una varietà di servizi cloud, che possono andare da una decina a centinaia di servizi differenti.</p>\n<p><strong>Architettura Cloud</strong>: Questi servizi cloud possono essere combinati insieme per creare un’architettura cloud personalizzata per le esigenze del cliente.</p>\n<p><strong>API Unificata</strong>: Gli utenti possono accedere a questi servizi attraverso una singola API unificata, semplificando notevolmente l’interazione con i servizi.</p>\n<p><strong>Billing a Consumo</strong>: La fatturazione dei servizi cloud è basata sull’uso effettivo, misurato in unità come secondi, ore, numero di CPU, spazio di archiviazione, ecc.</p>\n<p><strong>Sistema di Monitoraggio</strong>: I CSP incorporano sistemi di monitoraggio avanzati all’interno dei loro servizi, come ad esempio AWS CloudTrail, per tracciare e registrare le attività.</p>\n<p><strong>Infrastruttura come Servizio (IaaS)</strong>: Forniscono servizi cloud che includono infrastruttura come servizio, consentendo agli utenti di utilizzare risorse di rete, computer, e spazio di archiviazione su richiesta.</p>\n<p><strong>Automazioni Infrastructure as Code (IaC)</strong>: I CSP spesso supportano approcci di automazione basati su codice per la gestione delle risorse cloud.</p>\n<h3 id=\"livelli-di-csp\">Livelli di CSP <a class=\"heading-anchor-permalink\" href=\"#livelli-di-csp\">#</a></h3>\n<p>Esistono diverse categorie di CSP, suddivise in tre livelli principali:</p>\n<p><strong>Tier-1</strong>: CSP di primo livello, tra cui Amazon Web Service, Microsoft Azure, Google Cloud Platform e Alibaba Cloud. Sono noti per la vasta gamma di servizi e la presenza globale.</p>\n<p><strong>Tier-2</strong>: CSP di secondo livello, tra cui IBM Cloud, Oracle Cloud e Rackspace. Offrono una serie di servizi cloud ma potrebbero avere una presenza meno estesa rispetto ai Tier-1.</p>\n<p><strong>Tier-3</strong>: CSP di terzo livello, come Vultr, Digital Ocean e Linode. Sono spesso noti per la semplicità e l’accessibilità dei loro servizi cloud.</p>\n<h3 id=\"tipi-di-servizi-cloud-principali\">Tipi di Servizi Cloud Principali <a class=\"heading-anchor-permalink\" href=\"#tipi-di-servizi-cloud-principali\">#</a></h3>\n<p>I CSP offrono una varietà di servizi cloud, ma ci sono quattro tipi principali di servizi cloud, noti come i “4 core” per l’infrastruttura come servizio (IaaS):</p>\n<p><strong>Compute</strong>: Fornisce macchine virtuali in cui è possibile eseguire applicazioni, programmi e codice.</p>\n<p><strong>Networking</strong>: Offre servizi di rete, tra cui reti virtuali o reti isolate per collegare servizi o fornire connettività verso Internet.</p>\n<p><strong>Storage</strong>: Mette a disposizione spazio di archiviazione virtuale per salvare file e dati.</p>\n<p><strong>Databases</strong>: Fornisce database virtuali per l’archiviazione e la gestione di dati, da report a database di uso generale per applicazioni web.</p>\n<p>È importante notare che il termine “Cloud Computing” può essere utilizzato in riferimento a tutte queste categorie, anche se il termine “Compute” è incluso nel nome.</p>\n<h2 id=\"tipi-di-cloud-computing\">Tipi di Cloud Computing <a class=\"heading-anchor-permalink\" href=\"#tipi-di-cloud-computing\">#</a></h2>\n<p><strong>SaaS (Software as a Service)</strong>: Questo è rivolto ai clienti. Si tratta di un prodotto gestito dal provider del servizio. Gli utenti non devono preoccuparsi di come viene mantenuto il servizio. Funziona e rimane disponibile per l’uso.</p>\n<p><strong>PaaS (Platform as a Service)</strong>: Questo è rivolto agli sviluppatori. Il focus è sul deployment e sulla gestione delle applicazioni. Gli sviluppatori non devono preoccuparsi dell’approvvigionamento, della configurazione o dell’infrastruttura sottostante, come hardware o sistema operativo.</p>\n<p><strong>IaaS (Infrastructure as a Service)</strong>: Questo è rivolto agli amministratori IT. Fornisce funzionalità di networking, computer e spazio di archiviazione. È il fondamento principale per la gestione dell’infrastruttura cloud.</p>\n<h2 id=\"modelli-di-distribuzione-del-cloud-computing\">Modelli di Distribuzione del Cloud Computing <a class=\"heading-anchor-permalink\" href=\"#modelli-di-distribuzione-del-cloud-computing\">#</a></h2>\n<p><strong>Public Cloud</strong>: In questa modalità, tutto, dall’ambiente di lavoro ai progetti, è costruito su un CSP (Cloud Service Provider). Questo è spesso chiamato approccio “Cloud-Native” o “Cloud First”.</p>\n<p><strong>Private Cloud</strong>: In questo caso, tutto è costruito all’interno del datacenter di un’azienda, spesso chiamato anche approccio “On-Premise”.</p>\n<p><strong>Hybrid</strong>: Questo modello combina sia l’infrastruttura cloud sia l’infrastruttura on-premise. Gli utenti utilizzano entrambi in base alle esigenze.</p>\n<p><strong>Cross-Cloud</strong>: In questo modello, vengono utilizzati più CSP diversi, noto anche come “Multi-cloud”.</p>\n<h2 id=\"i-vantaggi-del-cloud\">I Vantaggi del Cloud <a class=\"heading-anchor-permalink\" href=\"#i-vantaggi-del-cloud\">#</a></h2>\n<p><strong>Agilità</strong>: Migliorare la velocità e l’agilità operativa.</p>\n<p><strong>Pricing Pay-as-You-Go</strong>: Cambiare da costi iniziali a una spesa variabile basata sull’uso effettivo.</p>\n<p><strong>Economie di Scala</strong>: Beneficiare delle economie di scala offerte dai grandi CSP.</p>\n<p><strong>Raggiungibilità Globale</strong>: Distribuire servizi globalmente in pochi minuti.</p>\n<p><strong>Sicurezza</strong>: Sicurezza fisica fornita dal cloud, ma possibilità di personalizzare le configurazioni di sicurezza.</p>\n<p><strong>Affidabilità</strong>: Disponibilità di backup, ripristino da disastro, replicazione dati e tolleranza ai guasti.</p>\n<p><strong>Scalabilità</strong>: Aumentare o diminuire risorse e servizi in base alle necessità.</p>\n<p><strong>Elasticità</strong>: Scalare automaticamente durante i picchi e i cali della domanda.</p>\n<p><strong>Fault Tolerance</strong>: La capacità di un sistema cloud di tollerare guasti hardware o software senza subire interruzioni significative dei servizi. Ciò contribuisce a garantire la continuità operativa e la disponibilità dei servizi anche in caso di problemi tecnici.</p>\n<p><strong>Disaster Recovery</strong>: La capacità di ripristinare rapidamente i dati e i servizi in caso di eventi catastrofici o perdite di dati. Il cloud offre soluzioni di disaster recovery efficaci che consentono di proteggere i dati e ripristinare i servizi in tempi brevi.</p>\n",
      "id": 2
    },
    {
      "path": "02-AWS Infrastructure.md",
      "url": "02-AWS Infrastructure.html",
      "content": "# AWS Infrastructure\r\n\r\n## Infrastruttura Globale AWS\r\n\r\nL'infrastruttura globale di AWS è costituita da una vasta rete di data center e risorse hardware connessi tramite una rete globale, che agisce come una singola risorsa globale per gli utenti finali. La struttura di AWS Global Infrastructure include:\r\n\r\n- 25 regioni operative\r\n- 81 zone di disponibilità (Availability Zone)\r\n- 108 posizioni di connessione diretta (Direct Connection Locations)\r\n- Più di 275 punti di presenza (Point of Presence)\r\n- 11 Local Zone\r\n- 17 Wavelength Zone\r\n\r\n\r\n## Regioni\r\n\r\nLe regioni AWS sono aree geografiche separate, ognuna delle quali consiste in una o più zone di disponibilità. Generalmente, ogni regione ha almeno 3 zone di disponibilità, sebbene i nuovi utenti possano avere accesso a 2 di esse inizialmente. Nuovi servizi di solito vengono resi disponibili nella prima zona di disponibilità. Non tutti i servizi AWS sono disponibili in tutte le regioni, e i costi dei servizi possono variare da una regione all'altra.\r\n\r\nQuando si sceglie una regione, è importante considerare quattro fattori:\r\n\r\n- Conformità normativa nella regione.\r\n- Costi dei servizi AWS nella regione.\r\n- Disponibilità dei servizi nella regione.\r\n- Distanza o latenza per gli utenti finali.\r\n\r\n\r\n## Zone di Disponibilità (AZ)\r\n\r\nUna zona di disponibilità è un'area fisica che contiene uno o più data center. Ogni data center è un edificio sicuro che ospita centinaia di migliaia di server. In genere, una regione AWS ha tre zone di disponibilità, e questi data center sono separati e isolati fisicamente, ma sono sufficientemente vicini da garantire una bassa latenza (meno di 10 ms). È una pratica comune distribuire i carichi di lavoro in almeno tre zone di disponibilità per garantire l'alta disponibilità in caso di guasti in uno o due data center.\r\n\r\nOgni sottorete (subnet) è associata a una zona di disponibilità, ma quando si lanciano risorse, si sceglie la sottorete piuttosto che la zona di disponibilità.\r\n\r\n\r\n## Fault Tolerance (Tolleranza ai guasti)\r\n\r\n### Fault Domain\r\n\r\nUn fault domain è una parte della rete che è vulnerabile a guasti hardware o a danni a dispositivi. L'obiettivo del fault domain è limitare al massimo i danni in caso di failure, in modo che non si verifichi una cascata di guasti. I fault domain possono essere nidificati all'interno di altri fault domain, e ciò può comportare diversi livelli di tolleranza ai guasti, con scope che possono essere specifici server in un rack, l'intero rack in un data center, un'intera stanza in un data center o persino l'intero data center. La definizione dei confini del dominio di errore è responsabilità del fornitore di servizi cloud (CSP).\r\n\r\nOgni regione AWS è progettata per essere completamente isolata dalle altre regioni, il che offre la massima possibilità di tolleranza ai guasti e stabilità. Ogni zona di disponibilità è isolata ma è collegata con collegamenti a bassa latenza alle altre regioni, e ciascuna regione ha un piano indipendente per le zone di errore (failure zone).\r\n\r\n\r\n### Failure Zone\r\n\r\nOgni zona di disponibilità è fisicamente separata dalle altre e di solito è situata in una città diversa, spesso in aree a basso rischio di eventi come alluvioni. Ogni zona di disponibilità dispone di un'alimentazione ininterrotta (UPS Uninterruptible power supply) e di un sito di backup per la generazione di energia. Inoltre, le zone di disponibilità sono connesse in modo ridondante ai provider di rete tier-1.\r\n\r\n\r\n## Rete Globale\r\n\r\nLa rete globale di AWS rappresenta l'interconnessione dell'intera infrastruttura globale di AWS ed è spesso chiamata \"la spina dorsale di AWS\". Questa rete è progettata come un'autostrada privata per consentire un rapido transito dei dati tra i data center.\r\n\r\n\r\n## Point of Presence (PoP)\r\n\r\nUn Point of Presence, o PoP, è una posizione intermedia tra una regione AWS e l'utente finale. Un PoP può essere costituito da un data center o da una collezione di hardware. Per AWS, un PoP può essere un data center di proprietà di AWS o di un partner fidato, utilizzato per la distribuzione di contenuti o per il caricamento accelerato dei dati. I tipi di risorse PoP includono le edge location e le regional edge caches.\r\n\r\n**Edge Locations**: sono data center che fungono da cache per i file più popolari, come pagine web, immagini e video, al fine di ridurre il tempo di consegna all'utente finale.\r\n\r\n**Regional Edge Locations**: sono data center che mantengono una cache di file meno popolari, contribuendo a ridurre i costi di trasferimento dei dati.\r\n\r\nI PoP sono situati ai bordi delle interconnessioni tra reti e spesso sono collegati a reti tier-1, che possono raggiungere tutte le altre reti senza dover pagare per gli indirizzi IP di transito o le tariffe di peering.\r\n\r\n\r\n## AWS Direct Connect\r\n\r\nAWS Direct Connect è un servizio che offre connessioni private e dedicate tra il tuo data center, il tuo ufficio, i tuoi spazi di co-location e AWS. Direct Connect offre due opzioni di connessione a velocità elevate:\r\n\r\n- Banda larga inferiore (50-500 Mbps)\r\n- Banda larga superiore (1-10 Gbps)\r\n\r\nQuesto servizio aiuta a ridurre i costi di rete e migliora la coerenza e la sicurezza delle connessioni rispetto a una connessione Internet tipica.\r\n\r\n\r\n## Direct Connect Locations\r\n\r\nLe Direct Connect Locations sono partner di data center verificati dove è possibile stabilire connessioni ad alta velocità dedicate e a bassa latenza tra la tua infrastruttura locale (on-premis) e AWS.\r\n\r\n\r\n## AWS Local Zones\r\n\r\nLe Local Zones sono data center situati in prossimità di aree densamente popolate per garantire una latenza estremamente bassa, nell'ordine dei millisecondi. Queste strutture sono progettate per supportare applicazioni altamente esigenti che richiedono bassa latenza, tra cui:\r\n\r\n- Media & Intrattenimento\r\n- Automazione del Design Elettronico\r\n- Advertising Technology (Ad-Tech)\r\n- Machine Learning\r\n\r\n\r\n## Wavelength Zones\r\n\r\nLe Wavelength Zones abilitano l'edge computing sulle reti 5G. Sono progettate per applicazioni che richiedono una latenza ultra-bassa e devono essere più vicine possibile agli utenti finali. AWS ha stretto collaborazioni con diverse aziende di reti 5G per offrire queste zone. Puoi creare una sottorete nelle Wavelength Zones e lanciare macchine virtuali (VM) sull'edge delle reti 5G.\r\n\r\n\r\n## Data Residency\r\n\r\n**Cosa è la Data Residency?**\r\n\r\nLa Data Residency si riferisce alla posizione fisica o geografica in cui un'organizzazione o le risorse cloud risiedono.\r\n\r\n**Cosa sono le Compliance Boundaries?**\r\n\r\nLe Compliance Boundaries sono normative legali stabilite da un governo o da un'organizzazione che specificano dove i dati e le risorse cloud possono essere ospitati e archiviati in conformità con le leggi e i regolamenti.\r\n\r\n**Cosa è la Data Sovereignty?** \r\n\r\nLa Data Sovereignty riguarda il controllo giurisdizionale o l'autorità legale che si applica ai dati a causa della loro posizione fisica entro i confini giurisdizionali.\r\n\r\nPer i carichi di lavoro che richiedono rigorose restrizioni di conformità in termini di posizione dei dati e risorse cloud su AWS, è possibile utilizzare diverse soluzioni:\r\n\r\n- **AWS Config**: AWS Config è un servizio di Policy as Code che consente di definire regole per verificare continuamente la conformità delle configurazioni delle risorse AWS. In caso di violazioni, è possibile ricevere notifiche o, in alcuni casi, AWS Config può correggere automaticamente la configurazione errata.\r\n\r\n<!---->\r\n\r\n- **AWS Outposts**: AWS Outposts è un servizio che offre un rack di server fisici forniti da Amazon che è possibile collocare nel proprio data center. Questi server mantengono i dati nella posizione fisica in cui si trova l'Outpost.\r\n\r\n<!---->\r\n\r\n- **IAM Policies**: Le IAM (Identity and Access Management) Policies possono essere utilizzate per rifiutare l'accesso a specifiche regioni AWS. Le Service Control Policies (SCP) sono autorizzazioni applicate a livello di organizzazione che possono limitare l'accesso alle regioni specifiche.\r\n\r\n\r\n## AWS for Government\r\n\r\n**Cos'è il Settore Pubblico?** \r\n\r\nIl settore pubblico comprende servizi governativi come l'esercito, le forze dell'ordine, le infrastrutture, i servizi pubblici, l'istruzione pubblica, l'assistenza sanitaria e il governo stesso. AWS può essere utilizzato sia dal settore pubblico che dalle organizzazioni per ospitare carichi di lavoro destinati al settore pubblico. AWS ha raggiunto questo obiettivo attraverso programmi di conformità normativa specifici e controlli di sicurezza rigorosi.\r\n\r\n**GovCloud:** GovCloud è una regione AWS speciale progettata per soddisfare le esigenze del governo degli Stati Uniti. Si basa sul programma Federal Risk and Authorization Management Program (FedRAMP), che stabilisce standard di sicurezza, valutazioni, autorizzazioni e monitoraggio continuo per i prodotti e i servizi cloud.\r\n\r\n\r\n### AWS in Cina\r\n\r\nAWS in Cina è la versione di AWS progettata specificamente per il mercato cinese. È completamente isolata dalla rete globale di AWS per conformarsi alle regolamentazioni cinesi. Per operare in una regione AWS in Cina, è necessaria una licenza di business chiamata China Business License (ICP license). Non tutti i servizi AWS sono disponibili in Cina, ad esempio Route 53. Utilizzando AWS in Cina, è possibile evitare di attraversare il \"Great Firewall\" cinese. AWS ha due regioni in Cina, entrambe fornite da partner cinesi.\r\n\r\n\r\n## Sustainability\r\n\r\nAWS si impegna a raggiungere l'obiettivo di zero emissioni nette di carbonio entro il 2040 in tutte le attività Amazon, compreso AWS. Gli obiettivi di sostenibilità di AWS sono suddivisi in tre parti:\r\n\r\n- Energia rinnovabile: AWS sta lavorando per alimentare l'intera infrastruttura globale con fonti di energia rinnovabile al 100% entro il 2025.\r\n\r\n<!---->\r\n\r\n- Efficienza del cloud: L'infrastruttura di AWS è 3,6 volte più efficiente dal punto di vista energetico rispetto alla media dei data center negli Stati Uniti.\r\n\r\n<!---->\r\n\r\n- Gestione dell'acqua: AWS utilizza diverse strategie per gestire l'acqua in modo sostenibile, tra cui l'evaporazione diretta dell'acqua per il raffreddamento dei data center, l'uso di acqua non potabile (acqua riciclata), il trattamento per rimuovere i minerali e il riutilizzo dell'acqua per più cicli.\r\n\r\n\r\n## AWS Ground Station\r\n\r\nAWS Ground Station è un servizio che consente di controllare le comunicazioni satellitari, elaborare i dati e scalare senza dover costruire e gestire un'infrastruttura a terra. Questo servizio è utile per una serie di casi d'uso, tra cui previsioni meteorologiche, imaging della superficie terrestre, comunicazioni e trasmissioni video.\r\n\r\n\r\n## AWS Outposts\r\n\r\n**AWS Outposts:** AWS Outposts è un servizio che consente di estendere l'infrastruttura AWS nel proprio data center, nello spazio di co-location o in una struttura on-premise. Questo servizio offre la stessa infrastruttura AWS, servizi AWS, API e strumenti che sono disponibili nelle regioni AWS, consentendo di creare un ambiente ibrido che combina l'infrastruttura locale con le capacità scalabili e flessibili di AWS.\r\n",
      "html": "<h1 id=\"aws-infrastructure\">AWS Infrastructure <a class=\"heading-anchor-permalink\" href=\"#aws-infrastructure\">#</a></h1>\n<h2 id=\"infrastruttura-globale-aws\">Infrastruttura Globale AWS <a class=\"heading-anchor-permalink\" href=\"#infrastruttura-globale-aws\">#</a></h2>\n<p>L’infrastruttura globale di AWS è costituita da una vasta rete di data center e risorse hardware connessi tramite una rete globale, che agisce come una singola risorsa globale per gli utenti finali. La struttura di AWS Global Infrastructure include:</p>\n<ul>\n<li>25 regioni operative</li>\n<li>81 zone di disponibilità (Availability Zone)</li>\n<li>108 posizioni di connessione diretta (Direct Connection Locations)</li>\n<li>Più di 275 punti di presenza (Point of Presence)</li>\n<li>11 Local Zone</li>\n<li>17 Wavelength Zone</li>\n</ul>\n<h2 id=\"regioni\">Regioni <a class=\"heading-anchor-permalink\" href=\"#regioni\">#</a></h2>\n<p>Le regioni AWS sono aree geografiche separate, ognuna delle quali consiste in una o più zone di disponibilità. Generalmente, ogni regione ha almeno 3 zone di disponibilità, sebbene i nuovi utenti possano avere accesso a 2 di esse inizialmente. Nuovi servizi di solito vengono resi disponibili nella prima zona di disponibilità. Non tutti i servizi AWS sono disponibili in tutte le regioni, e i costi dei servizi possono variare da una regione all’altra.</p>\n<p>Quando si sceglie una regione, è importante considerare quattro fattori:</p>\n<ul>\n<li>Conformità normativa nella regione.</li>\n<li>Costi dei servizi AWS nella regione.</li>\n<li>Disponibilità dei servizi nella regione.</li>\n<li>Distanza o latenza per gli utenti finali.</li>\n</ul>\n<h2 id=\"zone-di-disponibilit%C3%A0-(az)\">Zone di Disponibilità (AZ) <a class=\"heading-anchor-permalink\" href=\"#zone-di-disponibilit%C3%A0-(az)\">#</a></h2>\n<p>Una zona di disponibilità è un’area fisica che contiene uno o più data center. Ogni data center è un edificio sicuro che ospita centinaia di migliaia di server. In genere, una regione AWS ha tre zone di disponibilità, e questi data center sono separati e isolati fisicamente, ma sono sufficientemente vicini da garantire una bassa latenza (meno di 10 ms). È una pratica comune distribuire i carichi di lavoro in almeno tre zone di disponibilità per garantire l’alta disponibilità in caso di guasti in uno o due data center.</p>\n<p>Ogni sottorete (subnet) è associata a una zona di disponibilità, ma quando si lanciano risorse, si sceglie la sottorete piuttosto che la zona di disponibilità.</p>\n<h2 id=\"fault-tolerance-(tolleranza-ai-guasti)\">Fault Tolerance (Tolleranza ai guasti) <a class=\"heading-anchor-permalink\" href=\"#fault-tolerance-(tolleranza-ai-guasti)\">#</a></h2>\n<h3 id=\"fault-domain\">Fault Domain <a class=\"heading-anchor-permalink\" href=\"#fault-domain\">#</a></h3>\n<p>Un fault domain è una parte della rete che è vulnerabile a guasti hardware o a danni a dispositivi. L’obiettivo del fault domain è limitare al massimo i danni in caso di failure, in modo che non si verifichi una cascata di guasti. I fault domain possono essere nidificati all’interno di altri fault domain, e ciò può comportare diversi livelli di tolleranza ai guasti, con scope che possono essere specifici server in un rack, l’intero rack in un data center, un’intera stanza in un data center o persino l’intero data center. La definizione dei confini del dominio di errore è responsabilità del fornitore di servizi cloud (CSP).</p>\n<p>Ogni regione AWS è progettata per essere completamente isolata dalle altre regioni, il che offre la massima possibilità di tolleranza ai guasti e stabilità. Ogni zona di disponibilità è isolata ma è collegata con collegamenti a bassa latenza alle altre regioni, e ciascuna regione ha un piano indipendente per le zone di errore (failure zone).</p>\n<h3 id=\"failure-zone\">Failure Zone <a class=\"heading-anchor-permalink\" href=\"#failure-zone\">#</a></h3>\n<p>Ogni zona di disponibilità è fisicamente separata dalle altre e di solito è situata in una città diversa, spesso in aree a basso rischio di eventi come alluvioni. Ogni zona di disponibilità dispone di un’alimentazione ininterrotta (UPS Uninterruptible power supply) e di un sito di backup per la generazione di energia. Inoltre, le zone di disponibilità sono connesse in modo ridondante ai provider di rete tier-1.</p>\n<h2 id=\"rete-globale\">Rete Globale <a class=\"heading-anchor-permalink\" href=\"#rete-globale\">#</a></h2>\n<p>La rete globale di AWS rappresenta l’interconnessione dell’intera infrastruttura globale di AWS ed è spesso chiamata “la spina dorsale di AWS”. Questa rete è progettata come un’autostrada privata per consentire un rapido transito dei dati tra i data center.</p>\n<h2 id=\"point-of-presence-(pop)\">Point of Presence (PoP) <a class=\"heading-anchor-permalink\" href=\"#point-of-presence-(pop)\">#</a></h2>\n<p>Un Point of Presence, o PoP, è una posizione intermedia tra una regione AWS e l’utente finale. Un PoP può essere costituito da un data center o da una collezione di hardware. Per AWS, un PoP può essere un data center di proprietà di AWS o di un partner fidato, utilizzato per la distribuzione di contenuti o per il caricamento accelerato dei dati. I tipi di risorse PoP includono le edge location e le regional edge caches.</p>\n<p><strong>Edge Locations</strong>: sono data center che fungono da cache per i file più popolari, come pagine web, immagini e video, al fine di ridurre il tempo di consegna all’utente finale.</p>\n<p><strong>Regional Edge Locations</strong>: sono data center che mantengono una cache di file meno popolari, contribuendo a ridurre i costi di trasferimento dei dati.</p>\n<p>I PoP sono situati ai bordi delle interconnessioni tra reti e spesso sono collegati a reti tier-1, che possono raggiungere tutte le altre reti senza dover pagare per gli indirizzi IP di transito o le tariffe di peering.</p>\n<h2 id=\"aws-direct-connect\">AWS Direct Connect <a class=\"heading-anchor-permalink\" href=\"#aws-direct-connect\">#</a></h2>\n<p>AWS Direct Connect è un servizio che offre connessioni private e dedicate tra il tuo data center, il tuo ufficio, i tuoi spazi di co-location e AWS. Direct Connect offre due opzioni di connessione a velocità elevate:</p>\n<ul>\n<li>Banda larga inferiore (50-500 Mbps)</li>\n<li>Banda larga superiore (1-10 Gbps)</li>\n</ul>\n<p>Questo servizio aiuta a ridurre i costi di rete e migliora la coerenza e la sicurezza delle connessioni rispetto a una connessione Internet tipica.</p>\n<h2 id=\"direct-connect-locations\">Direct Connect Locations <a class=\"heading-anchor-permalink\" href=\"#direct-connect-locations\">#</a></h2>\n<p>Le Direct Connect Locations sono partner di data center verificati dove è possibile stabilire connessioni ad alta velocità dedicate e a bassa latenza tra la tua infrastruttura locale (on-premis) e AWS.</p>\n<h2 id=\"aws-local-zones\">AWS Local Zones <a class=\"heading-anchor-permalink\" href=\"#aws-local-zones\">#</a></h2>\n<p>Le Local Zones sono data center situati in prossimità di aree densamente popolate per garantire una latenza estremamente bassa, nell’ordine dei millisecondi. Queste strutture sono progettate per supportare applicazioni altamente esigenti che richiedono bassa latenza, tra cui:</p>\n<ul>\n<li>Media &amp; Intrattenimento</li>\n<li>Automazione del Design Elettronico</li>\n<li>Advertising Technology (Ad-Tech)</li>\n<li>Machine Learning</li>\n</ul>\n<h2 id=\"wavelength-zones\">Wavelength Zones <a class=\"heading-anchor-permalink\" href=\"#wavelength-zones\">#</a></h2>\n<p>Le Wavelength Zones abilitano l’edge computing sulle reti 5G. Sono progettate per applicazioni che richiedono una latenza ultra-bassa e devono essere più vicine possibile agli utenti finali. AWS ha stretto collaborazioni con diverse aziende di reti 5G per offrire queste zone. Puoi creare una sottorete nelle Wavelength Zones e lanciare macchine virtuali (VM) sull’edge delle reti 5G.</p>\n<h2 id=\"data-residency\">Data Residency <a class=\"heading-anchor-permalink\" href=\"#data-residency\">#</a></h2>\n<p><strong>Cosa è la Data Residency?</strong></p>\n<p>La Data Residency si riferisce alla posizione fisica o geografica in cui un’organizzazione o le risorse cloud risiedono.</p>\n<p><strong>Cosa sono le Compliance Boundaries?</strong></p>\n<p>Le Compliance Boundaries sono normative legali stabilite da un governo o da un’organizzazione che specificano dove i dati e le risorse cloud possono essere ospitati e archiviati in conformità con le leggi e i regolamenti.</p>\n<p><strong>Cosa è la Data Sovereignty?</strong></p>\n<p>La Data Sovereignty riguarda il controllo giurisdizionale o l’autorità legale che si applica ai dati a causa della loro posizione fisica entro i confini giurisdizionali.</p>\n<p>Per i carichi di lavoro che richiedono rigorose restrizioni di conformità in termini di posizione dei dati e risorse cloud su AWS, è possibile utilizzare diverse soluzioni:</p>\n<ul>\n<li><strong>AWS Config</strong>: AWS Config è un servizio di Policy as Code che consente di definire regole per verificare continuamente la conformità delle configurazioni delle risorse AWS. In caso di violazioni, è possibile ricevere notifiche o, in alcuni casi, AWS Config può correggere automaticamente la configurazione errata.</li>\n</ul>\n<!---->\n<ul>\n<li><strong>AWS Outposts</strong>: AWS Outposts è un servizio che offre un rack di server fisici forniti da Amazon che è possibile collocare nel proprio data center. Questi server mantengono i dati nella posizione fisica in cui si trova l’Outpost.</li>\n</ul>\n<!---->\n<ul>\n<li><strong>IAM Policies</strong>: Le IAM (Identity and Access Management) Policies possono essere utilizzate per rifiutare l’accesso a specifiche regioni AWS. Le Service Control Policies (SCP) sono autorizzazioni applicate a livello di organizzazione che possono limitare l’accesso alle regioni specifiche.</li>\n</ul>\n<h2 id=\"aws-for-government\">AWS for Government <a class=\"heading-anchor-permalink\" href=\"#aws-for-government\">#</a></h2>\n<p><strong>Cos’è il Settore Pubblico?</strong></p>\n<p>Il settore pubblico comprende servizi governativi come l’esercito, le forze dell’ordine, le infrastrutture, i servizi pubblici, l’istruzione pubblica, l’assistenza sanitaria e il governo stesso. AWS può essere utilizzato sia dal settore pubblico che dalle organizzazioni per ospitare carichi di lavoro destinati al settore pubblico. AWS ha raggiunto questo obiettivo attraverso programmi di conformità normativa specifici e controlli di sicurezza rigorosi.</p>\n<p><strong>GovCloud:</strong> GovCloud è una regione AWS speciale progettata per soddisfare le esigenze del governo degli Stati Uniti. Si basa sul programma Federal Risk and Authorization Management Program (FedRAMP), che stabilisce standard di sicurezza, valutazioni, autorizzazioni e monitoraggio continuo per i prodotti e i servizi cloud.</p>\n<h3 id=\"aws-in-cina\">AWS in Cina <a class=\"heading-anchor-permalink\" href=\"#aws-in-cina\">#</a></h3>\n<p>AWS in Cina è la versione di AWS progettata specificamente per il mercato cinese. È completamente isolata dalla rete globale di AWS per conformarsi alle regolamentazioni cinesi. Per operare in una regione AWS in Cina, è necessaria una licenza di business chiamata China Business License (ICP license). Non tutti i servizi AWS sono disponibili in Cina, ad esempio Route 53. Utilizzando AWS in Cina, è possibile evitare di attraversare il “Great Firewall” cinese. AWS ha due regioni in Cina, entrambe fornite da partner cinesi.</p>\n<h2 id=\"sustainability\">Sustainability <a class=\"heading-anchor-permalink\" href=\"#sustainability\">#</a></h2>\n<p>AWS si impegna a raggiungere l’obiettivo di zero emissioni nette di carbonio entro il 2040 in tutte le attività Amazon, compreso AWS. Gli obiettivi di sostenibilità di AWS sono suddivisi in tre parti:</p>\n<ul>\n<li>Energia rinnovabile: AWS sta lavorando per alimentare l’intera infrastruttura globale con fonti di energia rinnovabile al 100% entro il 2025.</li>\n</ul>\n<!---->\n<ul>\n<li>Efficienza del cloud: L’infrastruttura di AWS è 3,6 volte più efficiente dal punto di vista energetico rispetto alla media dei data center negli Stati Uniti.</li>\n</ul>\n<!---->\n<ul>\n<li>Gestione dell’acqua: AWS utilizza diverse strategie per gestire l’acqua in modo sostenibile, tra cui l’evaporazione diretta dell’acqua per il raffreddamento dei data center, l’uso di acqua non potabile (acqua riciclata), il trattamento per rimuovere i minerali e il riutilizzo dell’acqua per più cicli.</li>\n</ul>\n<h2 id=\"aws-ground-station\">AWS Ground Station <a class=\"heading-anchor-permalink\" href=\"#aws-ground-station\">#</a></h2>\n<p>AWS Ground Station è un servizio che consente di controllare le comunicazioni satellitari, elaborare i dati e scalare senza dover costruire e gestire un’infrastruttura a terra. Questo servizio è utile per una serie di casi d’uso, tra cui previsioni meteorologiche, imaging della superficie terrestre, comunicazioni e trasmissioni video.</p>\n<h2 id=\"aws-outposts\">AWS Outposts <a class=\"heading-anchor-permalink\" href=\"#aws-outposts\">#</a></h2>\n<p><strong>AWS Outposts:</strong> AWS Outposts è un servizio che consente di estendere l’infrastruttura AWS nel proprio data center, nello spazio di co-location o in una struttura on-premise. Questo servizio offre la stessa infrastruttura AWS, servizi AWS, API e strumenti che sono disponibili nelle regioni AWS, consentendo di creare un ambiente ibrido che combina l’infrastruttura locale con le capacità scalabili e flessibili di AWS.</p>\n",
      "id": 3
    },
    {
      "path": "workingCloudArchitecture Terminologies.md",
      "url": "workingCloudArchitecture Terminologies.html",
      "content": "# Cloud Architecture Terminologies\r\n\r\n2:14:31",
      "html": "<h1 id=\"cloud-architecture-terminologies\">Cloud Architecture Terminologies <a class=\"heading-anchor-permalink\" href=\"#cloud-architecture-terminologies\">#</a></h1>\n<p>2:14:31</p>\n",
      "id": 4
    }
  ]
}